In [1]:
print("OLá mundo")

OLá mundo

In [2]:
"Estou aprendendo Python"

'Estou aprendendo Python'

In [3]:
1 + 1

2

In [4]:
10 - 2

8

In [5]:
#Comentário em Python

In [6]:
#Multiplicação
2 * 2

4

In [10]:
#Divisão
10 / 2

5.0

In [11]:
a = 4 
b = 6

In [12]:
a + b

10

In [13]:
#Criando uma variavel do tipo string
frase = "Python para analise de dados"

In [14]:
frase[0]

'P'

In [15]:
frase[0:10]

'Python par'

In [16]:
frase[10:]

'a analise de dados'

In [17]:
frase[:17]

'Python para anali'

In [18]:
frase.count("dados")

1

In [19]:
frase.lower()

'python para analise de dados'

In [20]:
frase.upper()

'PYTHON PARA ANALISE DE DADOS'

In [21]:
frase.replace("Python","Frases")

'Frases para analise de dados'

In [22]:
#Criando lista
animais = [1,2,3]
animais

[1, 2, 3]

In [26]:
animais = ["cachorro","gato", 12345, 6.5]
animais

['cachorro', 'gato', 12345, 6.5]

In [28]:
#Imprimindo o primeiro elemento da lista
animais[0]

'cachorro'

In [29]:
animais[3]

6.5

In [30]:
#Substituindo o primeiro elemento da lista
animais[0] = "papagaio"

In [31]:
animais

['papagaio', 'gato', 12345, 6.5]

In [33]:
#Removendo gato da lista
animais.remove("gato")

In [34]:
animais

['papagaio', 12345, 6.5]

In [35]:
len(animais)

3

In [36]:
"gato" in animais

False

In [37]:
lista = [500,30,300,80,10]

In [38]:
max(lista)

500

In [39]:
min(lista)

10

In [46]:
animais.append(["leão","cachorro"])

In [47]:
animais

['papagaio', 12345, 6.5, 'leão', 'cobra', 6, ['leão', 'cachorro']]

In [48]:
animais.extend(["cobra",6])

In [49]:
animais.count("cachorro")

0

In [51]:
animais.count("leão")

1

In [50]:
lista.sort()

In [45]:
lista

[10, 30, 80, 300, 500]

In [52]:
#Tuplas
tp = ("Banana","Maçã",10,50)

In [53]:
tp[0]

'Banana'

In [54]:
#Diferentes das listas, as tuplas são imutáveis, o que quer dizer que não podemos alterar os seus elementos
tp[0] = "Laranja"
#Retorna erro porque Tuplas são imutáveis

TypeError: ignored

In [55]:
tp.count("Maçã")

1

In [56]:
tp[0:2]

('Banana', 'Maçã')

In [57]:
#Dicionarios -> Trabalha com conceito chave e valor
dc = {"Maçã":20,"Banana":10,"Laranja":15,"Uva":5}

In [58]:
dc

{'Banana': 10, 'Laranja': 15, 'Maçã': 20, 'Uva': 5}

In [59]:
dc["Maçã"]

20

In [60]:
dc["Maçã"] = 25
dc

{'Banana': 10, 'Laranja': 15, 'Maçã': 25, 'Uva': 5}

In [61]:
dc.keys()

dict_keys(['Maçã', 'Banana', 'Laranja', 'Uva'])

In [62]:
dc.values()

dict_values([25, 10, 15, 5])

In [63]:
dc.setdefault("Limão",22)

22

In [64]:
dc

{'Banana': 10, 'Laranja': 15, 'Limão': 22, 'Maçã': 25, 'Uva': 5}

In [65]:
#Pandas
import pandas as pd

In [71]:
df = pd.read_csv("/content/Gapminder.csv", error_bad_lines=False, sep=";")

In [72]:
#Visualizando as cinco primeiras linhas
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [75]:
#Modificando os nomes das colunas
df = df.rename(columns={"country":"Pais","continent":"Continente","year":"Ano","lifeExp":"Expectativa de vida","pop":"Pop Total","gdpPercap":"PIB"})

In [76]:
df.head(10)

          Pais Continente   Ano  Expectativa de vida  Pop Total         PIB
0  Afghanistan       Asia  1952               28.801    8425333  779.445314
1  Afghanistan       Asia  1957               30.332    9240934  820.853030
2  Afghanistan       Asia  1962               31.997   10267083  853.100710
3  Afghanistan       Asia  1967               34.020   11537966  836.197138
4  Afghanistan       Asia  1972               36.088   13079460  739.981106
5  Afghanistan       Asia  1977               38.438   14880372  786.113360
6  Afghanistan       Asia  1982               39.854   12881816  978.011439
7  Afghanistan       Asia  1987               40.822   13867957  852.395945
8  Afghanistan       Asia  1992               41.674   16317921  649.341395
9  Afghanistan       Asia  1997               41.763   22227415  635.341351

In [77]:
#Total de linhas e colunas do conjunto de dados
df.shape

(3312, 6)

In [78]:
df.columns

Index(['Pais', 'Continente', 'Ano', 'Expectativa de vida', 'Pop Total', 'PIB'], dtype='object')

In [79]:
#Tipo de dados de cada coluna
df.dtypes

Pais                    object
Continente              object
Ano                      int64
Expectativa de vida    float64
Pop Total                int64
PIB                    float64
dtype: object

In [81]:
#Últimas linhas 
df.tail(15)

          Pais Continente   Ano  Expectativa de vida  Pop Total          PIB
3297    Zambia     Africa  1997               40.238    9417789  1071.353818
3298    Zambia     Africa  2002               39.193   10595811  1071.613938
3299    Zambia     Africa  2007               42.384   11746035  1271.211593
3300  Zimbabwe     Africa  1952               48.451    3080907   406.884115
3301  Zimbabwe     Africa  1957               50.469    3646340   518.764268
3302  Zimbabwe     Africa  1962               52.358    4277736   527.272182
3303  Zimbabwe     Africa  1967               53.995    4995432   569.795071
3304  Zimbabwe     Africa  1972               55.635    5861135   799.362176
3305  Zimbabwe     Africa  1977               57.674    6642107   685.587682
3306  Zimbabwe     Africa  1982               60.363    7636524   788.855041
3307  Zimbabwe     Africa  1987               62.351    9216418   706.157306
3308  Zimbabwe     Africa  1992               60.377   10704340   693.420786
3309  Zimbabwe     Africa  1997               46.809   11404948   792.449960
3310  Zimbabwe     Africa  2002               39.989   11926563   672.038623
3311  Zimbabwe     Africa  2007               43.487   12311143   469.709298

In [82]:
df.describe()

               Ano  Expectativa de vida     Pop Total            PIB
count  3312.000000          3312.000000  3.312000e+03    3312.000000
mean   1980.301630            65.246871  3.161489e+07   11317.115805
std      16.927294            11.768412  1.041193e+08   11369.142739
min    1950.000000            23.599000  5.941200e+04     241.165877
25%    1967.000000            58.337500  2.678572e+06    2514.625266
50%    1982.000000            69.610000  7.557218e+06    7838.505123
75%    1996.000000            73.657750  1.958522e+07   17357.879170
max    2007.000000            82.670000  1.318683e+09  113523.132900

In [83]:
df["Continente"].unique()

array(['Asia', 'Europe', 'Africa', 'Americas', nan, 'FSU', 'Oceania'],
      dtype=object)

In [84]:
Oceania = df.loc[df["Continente"] == "Oceania"]
Oceania.head

<bound method NDFrame.head of                  Pais Continente  ...  Pop Total          PIB
975              Fiji    Oceania  ...     421869  2039.393277
976              Fiji    Oceania  ...     485000  2170.073285
977              Fiji    Oceania  ...     544000  2797.759484
978              Fiji    Oceania  ...     599339  3182.569600
979              Fiji    Oceania  ...     658906  3209.257468
...               ...        ...  ...        ...          ...
2696  Solomon Islands    Oceania  ...     300694  1783.648762
2697  Solomon Islands    Oceania  ...     358713  2109.894257
2698  Solomon Islands    Oceania  ...     424265  2252.491044
2699  Solomon Islands    Oceania  ...     494786  1530.496068
2700  Solomon Islands    Oceania  ...     566842  1829.317402

[74 rows x 6 columns]>

In [85]:
Oceania["Continente"].unique()

array(['Oceania'], dtype=object)

In [86]:
df.groupby("Continente")["Pais"].nunique()

Continente
Africa      51
Americas    25
Asia        41
Europe      35
FSU          6
Oceania      3
Name: Pais, dtype: int64

In [87]:
df.groupby("Ano")["Expectativa de vida"].min()

Ano
1950    40.00000
1951    55.10000
1952    28.80100
1953    44.55952
1954    46.46560
1955    48.02216
1956    50.44528
1957    30.33200
1958    50.15840
1959    38.40448
1960    31.63176
1961    34.10448
1962    31.99700
1963    51.89912
1964    53.32072
1965    55.64680
1966    56.80320
1967    34.02000
1968    59.40520
1969    60.96520
1970    62.65080
1971    63.73736
1972    35.40000
1973    62.78080
1974    62.49960
1975    62.69888
1976    62.43736
1977    31.22000
1978    64.24432
1979    65.08536
1980    66.12216
1981    66.44976
1982    38.44500
1983    68.95000
1984    68.99000
1985    68.93000
1986    69.13000
1987    39.90600
1988    69.96000
1989    69.41000
1990    69.36000
1991    69.11000
1992    23.59900
1993    65.24000
1994    63.93000
1995    64.62000
1996    65.89000
1997    36.08700
1998    67.13000
1999    65.99000
2000    65.37000
2001    65.29000
2002    39.19300
2003    64.92000
2004    65.30000
2005    65.33000
2006    66.62000
2007    39.61300
Name: Expectativa de vida, dtype: float64

In [89]:
df["PIB"].mean()

11317.115804696637

In [90]:
df["PIB"].sum()

37482287.5451553

In [91]:
#Leitura dos arquivos
df1 = pd.read_excel("Aracaju.xlsx")
df2 = pd.read_excel("Fortaleza.xlsx")
df3 = pd.read_excel("Natal.xlsx")
df4 = pd.read_excel("Recife.xlsx")
df5 = pd.read_excel("Salvador.xlsx")

In [92]:
#Juntando todos os arquivos
df = pd.concat([df1,df2,df3,df4,df5])

In [93]:
#Exibindo as 5 primeiras linhas
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [95]:
df1.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [96]:
df2.head()

      Cidade       Data  Vendas  LojaID  Qtde
0  Fortaleza 2019-01-01   45.27    1002     2
1  Fortaleza 2019-01-01  115.61    1002     3
2  Fortaleza 2019-02-10   35.33    1004     3
3  Fortaleza 2019-02-10   20.95    1004     6
4  Fortaleza 2019-01-01   14.25    1004     6

In [97]:
df3.head()

  Cidade       Data  Vendas  LojaID  Qtde
0  Natal 2018-08-27   606.0     853     2
1  Natal 2018-11-25   563.0     853     2
2  Natal 2019-03-11   308.0     852     3
3  Natal 2019-01-07   271.0     854     3
4  Natal 2019-03-09   699.0     853     3

In [98]:
df4.head()

   Cidade       Data  Vendas  LojaID  Qtde
0  Recife 2019-01-01  162.61     981     1
1  Recife 2019-01-01   11.44     983     1
2  Recife 2019-02-10   12.94     983     5
3  Recife 2019-02-10  160.54     981     3
4  Recife 2019-02-14   19.89     983     7

In [99]:
df5.head()

     Cidade       Data  Vendas  LojaID  Qtde
0  Salvador 2018-01-01   31.06    1037     3
1  Salvador 2018-01-01   19.02    1034     3
2  Salvador 2019-02-10  173.59    1035     3
3  Salvador 2019-02-10  176.34    1037     3
4  Salvador 2019-02-14   19.47    1037     3

In [94]:
#Exibindo as 5 ultimas linhas
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [101]:
#Pegando uma amostra
df.sample(5)

        Cidade       Data  Vendas  LojaID  Qtde
41    Salvador 2019-02-13    9.86    1035     2
198      Natal 2019-01-02   13.65    1037     3
200      Natal 2019-01-02   41.06    1035     1
7    Fortaleza 2019-02-11   35.50    1003     2
59    Salvador 2019-01-01  138.27    1034     2

In [100]:
#Verificando o tipo de dado de cada coluna
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [102]:
df["LojaID"] = df["LojaID"].astype("object")

In [103]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [104]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde
0  Aracaju 2018-01-01  142.00   1520     1
1  Aracaju 2018-01-01   14.21   1522     6
2  Aracaju 2018-01-01   71.55   1520     1
3  Aracaju 2018-01-01    3.01   1521     7
4  Aracaju 2018-01-01   24.51   1522     8

In [105]:
#Verificando valores nulos
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [106]:
#Substituindo os valores nulos pela media
df["Vendas"].fillna(df["Vendas"].mean(),inplace=True)

In [107]:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [108]:
df.sample(15)

        Cidade       Data  Vendas LojaID  Qtde
23      Recife 2019-01-01   37.51    982     2
58     Aracaju 2018-01-01   37.14   1520     7
181   Salvador 2019-01-02  244.83   1037     2
219   Salvador 2019-01-02   19.67   1037     2
74      Recife 2019-01-01   38.79    983     6
91     Aracaju 2018-01-01  200.85   1522     6
194   Salvador 2019-01-02  156.47   1035     1
184      Natal 2019-01-02  167.16   1037     1
93     Aracaju 2018-01-01  188.70   1523     1
113  Fortaleza 2019-03-02   38.63    980     2
156      Natal 2019-01-02   36.14   1037     3
79       Natal 2019-02-28  557.00    852     4
87     Aracaju 2018-01-01  116.71   1520     4
172   Salvador 2019-01-02    6.70   1035     1
182   Salvador 2019-01-02    6.60   1037     2

In [109]:
#Trabalhando com datas
df["Data"] = df["Data"].astype("int64")

In [110]:
df.dtypes

Cidade     object
Data        int64
Vendas    float64
LojaID     object
Qtde        int64
dtype: object

In [111]:
#Transformando coluna de data em data
df["Data"] = pd.to_datetime(df["Data"])

In [112]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [125]:
#Agrupando por ano
df.groupby(df["Data"].dt.year)["Receita"].sum()

Data
2018    118176.53
2019    228246.45
Name: Receita, dtype: float64

In [115]:
#Criando a coluna receitas
df["Receita"] = df["Vendas"].mul(df["Qtde"])

In [116]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Ano_Venda  Receita
0  Aracaju 2018-01-01  142.00   1520     1       2018   142.00
1  Aracaju 2018-01-01   14.21   1522     6       2018    85.26
2  Aracaju 2018-01-01   71.55   1520     1       2018    71.55
3  Aracaju 2018-01-01    3.01   1521     7       2018    21.07
4  Aracaju 2018-01-01   24.51   1522     8       2018   196.08

In [117]:
df["Receita/Vendas"] = df["Receita"] / df["Vendas"]

In [118]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Ano_Venda  Receita  Receita/Vendas
0  Aracaju 2018-01-01  142.00   1520     1       2018   142.00             1.0
1  Aracaju 2018-01-01   14.21   1522     6       2018    85.26             6.0
2  Aracaju 2018-01-01   71.55   1520     1       2018    71.55             1.0
3  Aracaju 2018-01-01    3.01   1521     7       2018    21.07             7.0
4  Aracaju 2018-01-01   24.51   1522     8       2018   196.08             8.0

In [119]:
df["Receita"].max()

3544.0

In [120]:
df["Receita"].min()

3.34

In [121]:
#nlargest 
df.nlargest(3,"Receita")

   Cidade       Data  Vendas LojaID  Qtde  Ano_Venda  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4       2019   3544.0             4.0
51  Natal 2018-01-21   859.0    852     4       2018   3436.0             4.0
55  Natal 2019-01-08   859.0    854     4       2019   3436.0             4.0

In [122]:
#nsmallest
df.nsmallest(3,"Receita")

      Cidade       Data  Vendas  ... Ano_Venda  Receita  Receita/Vendas
118  Aracaju 2018-01-01    3.34  ...      2018     3.34             1.0
65    Recife 2019-01-01    4.01  ...      2019     4.01             1.0
92     Natal 2019-01-02    4.57  ...      2019     4.57             1.0

[3 rows x 8 columns]

In [113]:
#Criando uma coluna
df["Ano_Venda"] = df["Data"].dt.year

In [123]:
#Agrupando por receita
df.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [124]:
#Ordenando o conjunto de dados
df.sort_values("Receita",ascending=False).head(10)

   Cidade       Data  Vendas LojaID  Qtde  Ano_Venda  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4       2019   3544.0             4.0
55  Natal 2019-01-08   859.0    854     4       2019   3436.0             4.0
51  Natal 2018-01-21   859.0    852     4       2018   3436.0             4.0
30  Natal 2018-10-02   856.0    853     4       2018   3424.0             4.0
41  Natal 2018-05-20   835.0    852     4       2018   3340.0             4.0
38  Natal 2018-02-25   828.0    852     4       2018   3312.0             4.0
10  Natal 2018-10-27   828.0    852     4       2018   3312.0             4.0
69  Natal 2019-03-24   817.0    852     4       2019   3268.0             4.0
62  Natal 2018-02-10   793.0    854     4       2018   3172.0             4.0
52  Natal 2018-04-27   778.0    854     4       2018   3112.0             4.0

In [114]:
df.sample(5)

        Cidade       Data  Vendas LojaID  Qtde  Ano_Venda
67   Fortaleza 2019-01-01   43.51   1003     1       2019
114      Natal 2019-01-02   25.52   1034     1       2019
113     Recife 2019-03-02   38.63    980     2       2019
30      Recife 2019-01-01   12.35    980     5       2019
195      Natal 2019-01-02   44.89   1036     3       2019

In [ ]:
#Extraindo o mês e o dia
df["mes_venda"],df

In [126]:
import matplotlib.pyplot as plt
plt.style.use("seaborn")

In [127]:
from google.colab import files
arq = files.upload()

Saving AdventureWorks.xlsx to AdventureWorks (1).xlsx

In [128]:
#Criando nosso DataFrame
df = pd.read_excel("AdventureWorks.xlsx")

In [129]:
#Visualizando as 5 primeiras linhas
df.head()

  Data Venda Data Envio  ID Loja  ...            Marca   Classe  Cor
0 2008-05-09 2008-05-29      199  ...  Adventure Works  Regular  Red
1 2008-05-12 2008-05-17      306  ...  Adventure Works  Regular  Red
2 2008-05-14 2008-05-20      306  ...  Adventure Works  Regular  Red
3 2008-05-21 2008-05-27      306  ...  Adventure Works  Regular  Red
4 2008-06-20 2008-06-27      306  ...  Adventure Works  Regular  Red

[5 rows x 16 columns]

In [130]:
#Quantidade de linhas e colunas
df.shape

(904, 16)

In [131]:
#Verificando os tipos de dados
df.dtypes

Data Venda        datetime64[ns]
Data Envio        datetime64[ns]
ID Loja                    int64
ID Produto                 int64
ID Cliente                 int64
No. Venda                 object
Custo Unitário           float64
Preço Unitário           float64
Quantidade                 int64
Valor Desconto           float64
Valor Venda              float64
Produto                   object
Fabricante                object
Marca                     object
Classe                    object
Cor                       object
dtype: object

In [132]:
#Reeita total
df["Valor Venda"].sum()

5984606.1426

In [134]:
#Custo total
df["Custo"] = df["Custo Unitário"].mul(df["Quantidade"])

In [135]:
df.head()

  Data Venda Data Envio  ID Loja  ...   Classe  Cor    Custo
0 2008-05-09 2008-05-29      199  ...  Regular  Red  2091.48
1 2008-05-12 2008-05-17      306  ...  Regular  Red  2091.48
2 2008-05-14 2008-05-20      306  ...  Regular  Red  2091.48
3 2008-05-21 2008-05-27      306  ...  Regular  Red  2091.48
4 2008-06-20 2008-06-27      306  ...  Regular  Red  2091.48

[5 rows x 17 columns]

In [136]:
df.head(1)

  Data Venda Data Envio  ID Loja  ...   Classe  Cor    Custo
0 2008-05-09 2008-05-29      199  ...  Regular  Red  2091.48

[1 rows x 17 columns]

In [137]:
#Custo total
round(df["Custo"].sum(),2)

2486783.05

In [139]:
df["Lucro"] = df["Valor Venda"] - df["Custo"]

In [140]:
df.head(1)

  Data Venda Data Envio  ID Loja  ID Produto  ...   Classe  Cor    Custo    Lucro
0 2008-05-09 2008-05-29      199         384  ...  Regular  Red  2091.48  2456.52

[1 rows x 18 columns]